app/Controllers/Mahasiswa.php

    public function baca()
    {

        $model = new ModelKelas();
        $data['data'] = $model->findAll();
---
SELECT *
FROM `data`